{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi", "Hey", "Is anyone there?","Hi there", "Hello", "Hey there", "Howdy", "Hola", "Bonjour", "Konnichiwa", "Guten tag", "Ola"],
     "responses": ["Hello there. Tell me how are you feeling today?", "Hi there. What brings you here today?", "Hi there. How are you feeling today?", "Great to see you. How do you feel currently?", "Hello there. Glad to see you're back. What's going on in your world right now?"]
    },
    {"tag": "morning",
        "patterns": ["Good morning","Morning",
        "Hi there, good morning","Lovely morning, isn't it?",
        "How's your morning so far?",
        "Greetings this fine morning",
        "Bright morning greetings",
        "Hey there! How's your day?",
        "Good morning! What's up?",
        "Nice to see you this morning",
        "Hi, hope your day's going well",
        "Hello, having a good morning?",
        "Happy morning!",
        "Good morning! How can I help you?",
        "Hello! Having a pleasant morning?",
        "Hi there! Enjoying the morning?",
        "Hey! Morning vibes",
        "Greetings! How's your morning going?",
        "Good morning! What's on your mind?"],
        "responses": ["Good morning. I hope you had a good night's sleep. How are you feeling today? ","Hello! Good morning. How can I assist you today?",
        "Hi there! Hope you're having a good morning. How can I help?","Hello! It's a beautiful morning. How can I help you today?",
        "Good morning! Feel free to share what's on your mind.",
        "Hi there! Let me know if there's anything I can do for you this morning.",
        "Hello! I'm here to chat. What's on your mind?",
        "Good morning! Need any assistance?",
        "Hi! How can I help you on this wonderful morning?",
        "Hello there! How's your day been so far?",
        "Good morning! Tell me, how can I assist you today?",
        "Hi there! How can I make your morning better?",
        "Hello! Need help with anything this morning?",
        "Good morning! I'm here to listen. What's up?",
        "Hi! Tell me what's on your mind this morning.",
        "Hello there! Need assistance or just a friendly chat?",
        "Good morning! How can I support you?",
        "Hi! Let's make this morning a good one. What do you need?",
        "Hello! Ready to chat. What's going on?",
        "Good morning! I'm here for you. How can I assist?"]
    },
    {"tag": "afternoon",
        "patterns": ["Good afternoon","Afternoon",
        "Hi there, good afternoon","Hey, good afternoon",
        "Good day",
        "Lovely afternoon, isn't it?",
        "How's your afternoon so far?",
        "Greetings this fine afternoon",
        "Warm afternoon greetings",
        "Hey there! How's your day?",
        "Good afternoon! What's up?",
        "Nice to see you this afternoon",
        "Hi, hope your day's going well",
        "Hello, having a good afternoon?",
        "Happy afternoon!",
        "Good afternoon! How can I help you?",
        "Hello! Having a pleasant afternoon?",
        "Hi there! Enjoying the afternoon?",
        "Hey! Afternoon vibes",
        "Greetings! How's your afternoon going?",
        "Good afternoon! What's on your mind?"],
        "responses": ["Good afternoon. How is your day going?","Hello! Good afternoon. How can I assist you today?",
        "Hi there! Hope you're having a good afternoon. How can I help?","Good afternoon! Feel free to share what's on your mind.",
        "Hi there! Let me know if there's anything I can do for you this afternoon.",
        "Hello! I'm here to chat. What's on your mind?",
        "Good afternoon! Need any assistance?",
        "Hi! How can I help you on this lovely afternoon?",
        "Hello there! How's your day been so far?",
        "Good afternoon! Tell me, how can I assist you today?",
        "Hi there! How can I make your afternoon better?",
        "Hello! Need help with anything this afternoon?",
        "Good afternoon! I'm here to listen. What's up?",
        "Hi! Tell me what's on your mind this afternoon.",
        "Hello there! Need assistance or just a friendly chat?",
        "Good afternoon! How can I support you?",
        "Hi! Let's make this afternoon a good one. What do you need?",
        "Hello! Ready to chat. What's going on?",
        "Good afternoon! I'm here for you. How can I assist?"]
    },
    {"tag": "evening",
        "patterns": ["Good evening","Getting dark now",
        "Evening has arrived",
        "What's going on tonight?",
        "I love evenings",
        "Any plans for tonight?",
        "The day is winding down",
        "Nightfall is here",
        "Sunset vibes",
        "Feels like a cozy evening",
        "Ready for the night?",
        "The stars are coming out",
        "Chill evening vibes",
        "End of a productive day",
        "Quiet evening at home",
        "Feeling relaxed this evening",
        "Looking forward to the night"],
        "responses": ["Good evening. How has your day been?","Hello there, how's your evening shaping up?",
        "Evenings are lovely. What's on your mind?",
        "Hi! How are you spending your evening?",
        "Good evening! Anything exciting happening?",
        "Hello! Ready for a chat this evening?",
        "Evenings have a special charm. What's new with you?",
        "Hey, good to see you this evening. How's it going?",
        "Good evening! Tell me about your day.",
        "Hello! What's the plan for this evening?",
        "Good evening! Anything interesting on your agenda?",
        "Hey there! How's your evening unfolding?",
        "Evenings are perfect for relaxation. What are you up to?",
        "Hello! How was your day? Anything to share?",
        "Good evening! How are you feeling at the end of the day?",
        "Hey, ready to unwind this evening?",
        "Evenings are great for reflecting. What's on your mind?",
        "Hello! Enjoying the peaceful evening?",
        "Good evening! What's brought you here today?",
        "Hey, how's your energy this evening?"]
    },
    {"tag": "night",
        "patterns": ["Good night","Time to sleep",
        "Bedtime",
        "Off to sleep",
        "Night time",
        "Sleepy now",
        "Ready to hit the bed",
        "Night has come",
        "Dark outside now",
        "Getting ready for bed",
        "End of the day",
        "Lights out soon",
        "Feeling tired",
        "Calling it a night",
        "Closing the day",
        "Restful night ahead",
        "Dreamland awaits",
        "Shutting down for the day",
        "Night owl",
        "Time for some rest",
        "Signing off for the night"],
        "responses": ["Good night. Get some proper sleep", "Good night. Sweet dreams.","Good night. May your dreams be peaceful.",
        "Have a restful night. Good night!",
        "Sleep tight and have wonderful dreams.",
        "Good night! Wishing you a peaceful sleep.",
        "May your night be calm and full of dreams.",
        "Rest well and wake up refreshed. Good night!",
        "Good night! Close your eyes and drift into dreamland.",
        "Wishing you a cozy night's sleep. Good night!",
        "Time to recharge. Good night and sleep well.",
        "Night is here. Have a restful sleep.",
        "Close your eyes, relax, and have a good night.",
        "May your dreams be as sweet as your slumber. Good night!",
        "Sleep tight and wake up refreshed tomorrow.",
        "Good night! Leave your worries behind and sleep peacefully.",
        "Wishing you a serene and restful night. Good night!",
        "Wrap up the day with a peaceful night's sleep.",
        "Good night! Let go of the day and embrace rest.",
        "Rest well and prepare for a new day ahead. Good night!"]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Au revoir", "Sayonara", "ok bye", "Bye then", "Fare thee well","Adios",
     "Time to go",
     "Signing off",
     "Later",
     "Stay safe",
     "Peace out",
     "See you around",
     "Keep well",
     "Arrivederci",
     "Have a good one",
     "So long",
     "Goodnight",
     "Until we meet again",
     "Take it easy",
     "Ciao",
     "Bye for now",
     "Goodbye for now"],
     "responses": ["See you later.", "Have a nice day.", "Bye! Come back again.", "I'll see you soon.","Adios! Come back soon.",
     "Time to go. Goodbye!",
     "Signing off now. See you next time!",
     "Later! Have a wonderful day.",
     "Stay safe and goodbye.",
     "Peace out! See you soon.",
     "See you around. Take care!",
     "Keep well and goodbye.",
     "Arrivederci! Until next time.",
     "Have a good one! Goodbye.",
     "So long! Take care.",
     "Goodnight! Sleep well.",
     "Until we meet again. Goodbye!",
     "Take it easy. See you later!",
     "Ciao! Have a great day.",
     "Bye for now. See you soon!",
     "Goodbye for now. Take care!"]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks for the help", "Than you very much","I appreciate it",
     "You've been a great help",
     "I owe you one",
     "Big thanks!",
     "You're a lifesaver",
     "Thanks a million"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You're most welcome!","Glad I could assist!",
     "It's my pleasure to be of help!",
     "You're very welcome!",
     "No problem at all!",
     "I'm here to support you!",
     "It's all good!",
     "You're appreciated!"]
    },
    {"tag": "no-response",
        "patterns": [""],
        "responses": ["Sorry, I didn't understand you.", "Please go on.", "Not sure I understand that.", "Please don't hesitate to talk to me."]
    },
    {"tag": "neutral-response",
        "patterns": ["nothing much","not really",
        "just chilling",
        "nothing new",
        "same old, same old",
        "Just here, what's up with you?",
        "Not much going on, how about you?",
        "Just taking it easy today.",
        "Quiet day, anything exciting happening?",
        "Just the usual routine.",
        "Nothing new to report.",
        "Just hanging out.",
        "Same old stuff.",
        "Just relaxing.",
        "Not really up to anything.",
        "Just here, feeling calm.",
        "Just enjoying some downtime.",
        "Not much happening around here.",
        "Just going with the flow.",
        "Just being lazy today.",
        "Nothing special going on.",
        "Not much on my mind.",
        "Just a regular day.",
        "Just existing.",
        "Taking it easy today."],
        "responses": ["Oh I see. Do you want to talk about something?","Got it. Is there anything specific on your mind?",
        "Understood. Is there anything you'd like to discuss or share?",
        "I understand. Is there something you'd like to talk about or ask?",
        "Okay. Is there a topic you'd like to explore or discuss?",
        "Got it. Is there anything specific you'd like to discuss or explore?",
        "Understood. Is there a topic you'd like to talk about or ask questions on?",
        "I understand. Is there something you'd like to share or get off your chest?",
        "Okay. Is there a particular subject or issue you'd like to delve into?",
        "Sounds peaceful. Is there anything on your mind you'd like to talk about?",
        "Noted. Is there a specific topic or question you'd like to bring up?",
        "Gotcha. Is there anything you want to discuss or learn about?",
        "I hear you. Is there something specific you'd like to talk about or explore?",
        "That's alright. Is there a particular topic or concern you want to discuss?",
        "Sounds relaxing. Is there anything specific you want to chat about?",
        "Enjoying the downtime is important. Is there anything you want to share or ask?",
        "Sometimes quiet days are nice. Is there a topic or question you have in mind?",
        "Going with the flow can be good. Is there anything you want to talk about or ask about?",
        "Taking it easy is great sometimes. Is there a topic or issue you're interested in?",
        "No problem. Is there anything on your mind you'd like to discuss?",
        "Just a regular day can sometimes be eventful too. Is there something you want to share?",
        "Existing and being calm can bring clarity. Is there a specific topic you're curious about?",
        "Relaxing is important. Is there something you want to talk about or ask?",
        "Taking it easy is good self-care. Is there a topic or question you have in mind?"]
    },
    {"tag": "about",
     "patterns": ["Who are you?", "What are you?", "Who you are?", "Tell me more about yourself.", "What is your name?", "What should I call you?", "What's your name?", "Tell me about yourself" ,"Are you a therapist?",
     "Do you provide therapy?",
     "What's your function?",
     "Are you a chatbot?",C
     "How were you created?",
     "Are you a real person?",
     "What's your role?",
     "Can you tell me more about your capabilities?",
     "What tasks can you assist with?",
     "Do you have emotions?",
     "Are you a robot?",
     "What is your primary function?",
     "How can I interact with you?"],
     "responses": ["I'm Zenayra, your Personal Therapeutic AI Assistant. How are you feeling today", "I'm Zenayra, a Therapeutic AI Assitant designed to assist you. Tell me about yourself.", "I'm Zenayra. I am a conversational agent designed to mimic a therapist. So how are you feeling today?", "You can call me Zenayra.", "I'm Zenayra!", "Call me Zenayra","I'm Zenayra, a conversational agent designed to mimic a therapist and provide support.",
     "I'm Zenayra, here to provide non-judgmental support and guidance.",
     "I'm Zenayra, designed to offer a listening ear and provide support for mental wellness.",
     "I'm Zenayra, an AI chatbot designed to assist with mental health and well-being.",
     "I'm Zenayra, created to provide emotional support and assist with mental well-being.",
     "I'm Zenayra, an AI chatbot programmed to provide support and guidance.",
     "I'm Zenayra, an AI designed to simulate therapeutic conversations and offer support.",
     "I'm Zenayra, an AI chatbot developed to assist with emotional well-being.",
     "I'm Zenayra, designed to provide assistance and support for mental health.",
     "I'm Zenayra, an AI chatbot without emotions but here to offer empathetic support.",
     "I'm Zenayra, an AI chatbot programmed to assist with mental health and emotional support.",
     "I'm Zenayra, designed to offer guidance and support for mental wellness.",
     "I'm Zenayra, here to engage in conversations and provide support for mental well-being."]
    },
    {"tag": "name",
        "patterns": ["My name is ", "I am name.", "I go by ",
        "They call me ",
        "People know me as ",
        "I'm referred to as ",
        "You can call me ",
        "My friends call me ",
        "I'm known by "],
        "responses": ["Oh nice to meet you. Tell me how was your week?", "Nice to meet you. So tell me. How do you feel today?", "That's a great name. Tell me more about yourself.",
        "Nice name! What's been on your mind lately?",
        "Good choice of name! Is there something you'd like to share or discuss?",
        "Hello, [name]! What brings you here today?",
        "Hello there, [name]. How can I assist you today?",
        "Hi [name], glad to see you here. How has your day been?",
        "Hi [name], how are you feeling today?",
        "Hello [name], welcome to our chat. Is there anything on your mind?",
        "Hello [name], nice to meet you. What would you like to talk about?",
        "Hello [name], I'm here to help. What's been happening in your world?",
        "Hi there, [name]. What's been going on in your life recently?",
        "Hello [name], it's great to have you here. What can I do for you today?",
        "Hi [name], good to see you. Is there something specific you want to discuss?",
        "Welcome, [name]! How can I support you today?",
        "Nice to meet you, [name]. How are you doing?",
        "Hello [name], it's a pleasure to meet you. What's on your mind?",
        "Hi [name], I'm here to chat. What's been going on with you?",
        "Hello [name], how can I assist you today?"]
    },
    {"tag": "help",
    "patterns": ["Could you help me?", "give me a hand please", "Can you help?", "What can you do for me?", "I need support", "I need help", "Support me please","I'm struggling and could use some assistance",
    "Do you have any advice for me?",
    "I'm feeling lost. Can you guide me?"],
    "responses": ["Sure. Tell me how can i assist you", "Tell me your problem so that i can assist you", "Yes, sure. How can I help you?","I'm here to help. Let's work together to find a solution.",
    "You're not alone. Let's talk about what's going on and figure out the next steps.",
    "Sharing your concerns with me is the first step. Let's explore solutions together.",
    "I'm here to offer support and guidance. What's on your mind?",
    "Feeling lost is understandable. Let's discuss your challenges and find ways to move forward.",
    "I'm ready to assist you. Describe the situation or issue you're facing.",
    "Together, we can find solutions. What specific assistance do you need?"]
    },
    {"tag": "sad",
    "patterns": ["I am feeling lonely", "I am so lonely", "I feel down", "I feel sad", "I am sad", "I feel so lonely", "I feel empty", "I don't have anyone","My beloved cat passed away last night", 
    "I spent the weekend alone with no one to talk to," ,"My partner and I decided to end our relationship," ,
    "I didn't get the promotion I worked so hard for," ,
    "My friend declined my invitation to hang out,",
     "I can't afford to pay my bills this month," ,"My chronic pain has been getting worse lately," ,
     "My family members had another big argument today,", "My plans for the weekend fell through,", "I witnessed a friend going through a tough time."],
    "responses": ["I'm sorry to hear that. I'm here for you. Talking about it might help. So, tell me why do you think you're feeling this way?", "I'm here for you. Could you tell me why you're feeling this way?", "Why do you think you feel this way?",
     "How long have you been feeling this way?",
    "I'm sorry to hear that. I'm here for you. Talking about it might help","I'm sorry to hear that. I'm here for you. Talking about it might help",
    "I'm sorry to hear that. I'm here for you. Talking about it might help","I'm sorry to hear that. I'm here for you. Talking about it might help"]
    },
    {"tag": "stressed",
        "patterns": ["I am so stressed out", "I am so stressed", "I feel stuck", "I still feel stressed", "I am so burned out","I can't handle this pressure",
        "Everything feels overwhelming",
        "I'm anxious all the time",
        "I feel like I'm drowning in responsibilities",
        "I need help managing stress"],
        "responses": ["What do you think is causing this?", "Take a deep breath and gather your thoughts. Go take a walk if possible. Stay hydrated", "Give yourself a break. Go easy on yourself.", "I am sorry to hear that. What is the reason behind this?","Break tasks into smaller, manageable steps. Prioritize and tackle one thing at a time to reduce overwhelm.",
        "Practice relaxation techniques such as deep breathing, meditation, or listening to calming music.",
        "Consider talking to a therapist or counselor for professional support and coping strategies.",
        "Set boundaries and learn to say no when needed. Your well-being is important.",
        "Engage in activities you enjoy and that help you relax, whether it's hobbies, exercise, or spending time with loved ones.",
        "Remember, it's okay to ask for help and delegate tasks. You don't have to do everything on your own."]
    },
    {"tag": "worthless",
        "patterns": ["I feel so worthless.", "No one likes me.", "I can't do anything.", "I am so useless", "Nothing makes sense anymore","I'm not good enough.",
        "I feel like a failure.",
        "I don't see my purpose in life.",
        "I'm struggling to find my worth."],
        "responses": ["It's only natural to feel this way. Tell me more. What else is on your mind?", "Let's discuss further why you're feeling this way.",
         "I first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change.",
          "i first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change.",
          "I'm sorry to hear that. I'm here for you. Talking about it might help","I'm sorry to hear that. I'm here for you. Talking about it might help","It's okay to have moments of self-doubt. You are capable and deserving of happiness.",
          "Challenge negative thoughts by focusing on your strengths and accomplishments. What are you proud of?",
          "You are unique and have a purpose in this world. Let's work together to uncover your strengths and passions.",
          "Your worth is not tied to perfection. Embrace your imperfections and learn from challenges as opportunities for growth.",
          "Seek out activities or hobbies that bring you joy and fulfillment. Doing things you love can boost your sense of worth."]
    },
    {"tag": "depressed",
        "patterns": ["I can't take it anymore", "I am so depressed", "I think i'm depressed.", "I have depression","I struggle to find meaning in everyday activities," ,
        "I don't have the energy to get out of bed most days," ,
        "I'm constantly feeling hopeless about the future," ,
        "My friends and family feel distant even when they're close by,",
         "I find it hard to enjoy things I used to love,",
          "I often think the world would be better off without me," ,
          "I've been neglecting my personal hygiene and self-care,",
           "I feel empty and disconnected from the world," ,
           "Every small task feels overwhelming," ,"I can't seem to concentrate on anything."





    ],
        "responses": ["It helps to talk about what's happening. You're going to be okay", "Talk to me. Tell me more. It helps if you open up yourself to someone else.", 
        "You're not alone in feeling this way, seeking support can help,",
         "It's important to talk to someone you trust about how you're feeling," ,
         "Try to take small steps towards positive changes, professional help can guide you," ,
         "Connecting with others may help you feel less isolated,",
          "Consider reaching out for professional support if you haven't already,", "Remember that you are valued and worthy, please seek help if you have thoughts of harming yourself,", "Practicing self-care can improve your well-being, start with small actions,", "Finding a support group can help you feel less alone," ,"Breaking tasks into smaller, manageable steps can help,", "Talking to a professional can help you regain focus and clarity."]
    },
    {
        "tag": "anxiety",
        "patterns": [
            "I feel so stressed out.",
            "I'm overwhelmed with anxiety.",
            "I can't seem to relax.",
            "My anxiety is getting the best of me.",
            "I'm constantly worried about everything.",
            "I feel like I'm suffocating under pressure.",
            "I feel a knot in my stomach all the time.",
        "I'm having panic attacks frequently.",
        "My heart races for no reason sometimes.",
        "I feel anxious in social situations.",
        "I avoid situations that trigger my anxiety.",
        "My mind is always racing with negative thoughts.",
        "I feel like I'm losing control because of anxiety.",
        "I'm scared of having another anxiety attack.",
        "I feel irritable and tense most of the time.",
        "Anxiety is affecting my work/school performance.",
        "I feel like I'm drowning in my worries.",
        "I struggle to relax even when I have free time.",
        "I have physical symptoms like sweating and shaking due to anxiety.",
        "I feel like I'm always on the verge of a breakdown.",
        "My anxiety is causing me to isolate myself from others."
        ],
        "responses": [
            "It's important to take a deep breath and try to focus on one thing at a time.",
            "Have you tried any relaxation techniques like deep breathing or meditation?",
            "Talking about your feelings can help reduce stress and anxiety. What's on your mind?",
            "Remember that it's okay to ask for help. Would you like some suggestions on managing stress?",
            "Taking breaks and engaging in activities you enjoy can help alleviate stress.",
            "Let's explore some coping strategies together. What usually helps you feel better?",
            "Practice self-compassion and remind yourself that it's okay to have anxious feelings.",
        "Engaging in physical activity or exercise can help release tension and reduce anxiety levels.",
        "Learning and practicing relaxation techniques like progressive muscle relaxation can be beneficial.",
        "Limiting caffeine and alcohol intake can also help manage anxiety symptoms.",
        "Have you tried incorporating mindfulness or deep-breathing exercises into your daily routine?",
        "Identify and challenge negative thought patterns that contribute to your anxiety.",
        "Creating a structured daily routine can provide a sense of control and reduce anxiety.",
        "Surround yourself with supportive and understanding people who can offer encouragement.",
        "Find activities that bring you joy and make time for them regularly to boost your mood.",
        "Consider exploring cognitive-behavioral therapy (CBT) techniques with a therapist.",
        "Use grounding techniques like focusing on your senses (sight, sound, touch) to stay present.",
        "Ensure you're getting adequate sleep as lack of sleep can worsen anxiety symptoms.",
        "Connect with online or local support groups for individuals dealing with anxiety.",
        "Explore natural remedies like herbal teas or aromatherapy for relaxation and stress relief.",
        "Practice self-care regularly and prioritize your mental and emotional well-being.",
        "Remember that progress takes time, and small steps forward are still steps in the right direction."
        ]
    },
    
    {"tag": "happy",
        "patterns": ["I feel great today.", "I am happy.", "I feel happy.", "I'm good.", "cheerful", "I'm fine", "I feel ok","I am feeling great today",
        "I just got my first job",
        "I had a great time in the part",
        "I am excited for the upcoming holiday.",
        "I got my first salary",
        "I had a good day",
        "I accomplished a goal I've been working towards.",
        "The sun is shining, and I feel alive!",
        "I'm in a positive and upbeat mood today.",
        "I had an amazing workout session.",
        "I'm grateful for the little things in life.",
        "I'm enjoying a relaxing day off.",
        "I'm feeling inspired and motivated.",
        "I received compliments that made my day.",
        "I'm looking forward to a fun event.",
        "I achieved something I thought was challenging.",
        "I'm surrounded by positivity and good vibes.",
        "I had a delicious meal that boosted my mood.",
        "I'm proud of myself for overcoming a hurdle.",
        "I found joy in simple pleasures today."],
        "responses": ["That's geat to hear. I'm glad you're feeling this way.", "Oh i see. That's great.", "Did something happen which made you feel this way?", "Oh i see. That's great.", "Oh i see. That's great.", "Oh i see. That's great.", "Oh i see. That's great.", "Oh i see. That's great.",
        "Family and friends have a way of lifting our mood. How did your time with them go?",
        "Setting and achieving goals is so fulfilling. What goal did you reach?",
        "Nature has a way of rejuvenating us. What outdoor activities do you enjoy?",
        "A positive mood can be contagious! What's contributing to your upbeat mood?",
        "Exercise can do wonders for our mental well-being. What workout did you do?",
        "Finding gratitude in everyday moments is beautiful. What are you grateful for?",
        "Relaxation time is crucial for our mental health. How did you spend your day off?",
        "Inspiration can come from many places. What inspired you today?",
        "Compliments are always nice to receive. What were the compliments about?",
        "Anticipation of fun events can be so exciting. What event are you looking forward to?",
        "Overcoming challenges shows strength and resilience. What was the challenge?",
        "Positive environments contribute to a positive mood. What's contributing to yours?",
        "Good food can really elevate our mood. What did you eat?",
        "Celebrating small victories is important. What did you achieve?",
        "Finding joy in simple pleasures is a great mindset. What simple pleasure did you enjoy?"]
    },
    {"tag": "casual",
        "patterns": ["Oh I see.", "ok", "okay", "nice", "Whatever", "K", "Fine", "yeah", "yes", "no", "not really","Got it",
        "Sure thing",
        "Cool",
        "I understand",
        "Alright",
        "Yep",
        "No worries",
        "That's fine"],
        "responses": ["Let's discuss further why you're feeling this way.", "How were you feeling last week?", "I'm listening. Please go on.", "Tell me more", "Can you elaborate on that?", "Come Come elucidate your thoughts","Interesting, tell me more about that.",
        "What else is on your mind?",
        "I'm here to listen. Share as much or as little as you'd like.",
        "Feel free to express yourself. This is a safe space.",
        "It's okay to take your time. I'm here whenever you're ready.",
        "I appreciate your honesty. Let's dive deeper into this.",
        "Your feelings are valid. Let's explore them together.",
        "I'm curious to hear more about your perspective.",
        "Thanks for sharing. How can I support you further?",
        "Your insights are valuable. Keep the conversation going."]
    },
    {"tag": "anxious",
        "patterns": ["I feel so anxious.", "I'm so anxious because of ","I'm feeling overwhelmed and anxious",
        "Anxiety is getting the best of me",
        "My anxiety is through the roof",
        "I can't shake off this anxious feeling",
        "I'm having an anxiety attack",
        "Feeling nervous and jittery",
        "I'm anxious about the future"],
        "responses": ["Don't be hard on yourself. What's the reason behind this?", "Can you tell me more about this feeling?", "I understand that it can be scary. Tell me more about it.", "Don't let the little worries bring you down. What's the worse that can happen?","Let's practice deep breathing together. Inhale for four seconds, hold for four, exhale for four. Repeat.",
        "Grounding techniques can help during anxiety. Focus on five things you can see, four things you can touch, three things you can hear, two things you can smell, and one thing you can taste.",
        "Have you tried mindfulness or meditation exercises? They can be beneficial for managing anxiety.",
        "Remember, it's okay to seek professional help if anxiety becomes overwhelming. Therapy and counseling can provide effective strategies.",
        "Creating a daily routine and setting achievable goals can help reduce anxiety and provide a sense of control.",
        "Engage in activities that bring you joy and relaxation. Taking breaks and practicing self-care are important for managing anxiety."]
    },
    {"tag": "not-talking",
        "patterns": ["I don't want to talk about it.", "No just stay away.", "I can't bring myself to open up.", "Just shut up","I'm not ready to talk right now.",
        "Leave me alone.",
        "Talking about it won't change anything.",
        "I feel too overwhelmed to talk.",
        "I'm afraid of being judged."],
        "responses": ["Talking about something really helps. If you're not ready to open up then that's ok. Just know that i'm here for you, whenever you need me.", "I want to help you. I really do. But in order for me to help you, you're gonna have to talk to me.", "I'm here to listen to you and help you vent. So please talk to me.","You can talk to me without fear of judgement.","I understand that it's difficult to talk about certain things. Take your time, and when you're ready, I'll be here.",
        "It's okay to feel hesitant about sharing. Your feelings are valid, and I'm here to support you whenever you're ready.",
        "Would you like to talk about something else instead? We can discuss topics that are more comfortable for you.",
        "Sometimes talking about it can lighten the burden. I'm here to listen whenever you're ready.",
        "You are not alone in this. We can take small steps together when you're comfortable."]
    },
    {"tag": "sleep",
        "patterns": ["I have insominia", "I am suffering from insomnia", "I can't sleep.", "I haven't slept for the last days.", "I can't seem to go to sleep.", "I haven't had proper sleep for the past few days.","I keep waking up at night",
        "I feel tired all the time",
        "My sleep schedule is messed up"],
        "responses": ["What do you think is the reason behind this?", "That seem awful. What do you think is behind this?","Let's explore some relaxation techniques together. Have you tried deep breathing or meditation?",
        "Creating a bedtime routine can help signal your body that it's time to sleep. Have you tried establishing a consistent sleep schedule?",
        "Avoiding caffeine and screen time before bed can improve sleep quality. Are there any habits you think might be affecting your sleep?",
        "Have you considered talking to a healthcare professional about your sleep concerns? They may offer helpful insights and solutions.",
        "Making your sleep environment comfortable and conducive to rest can promote better sleep. Have you tried adjusting your bedroom environment?",
        "Journaling about your thoughts or worries before bed can help clear your mind. Have you tried journaling as part of your bedtime routine?",
        "Regular exercise during the day can improve sleep quality. Have you incorporated physical activity into your daily routine?"]
    },
    {"tag": "scared",
        "patterns": ["I'm scared", "That sounds awful. What do i do?", "No i don't want to feel this way", "I am scared for myself","i'm constantly worried about the future," ,
        "I fear something bad will happen to me or my loved ones,",
         "My heart races when I think about certain situations,",
          "I'm afraid of being judged or criticized by others," ,
          "I dread going to certain places because of past experiences," ,
          "I avoid taking risks because I'm scared of failure," ,
          "I'm terrified of being alone at night,",
           "I worry about losing control in public," ,"I panic in social situations,", "I'm scared of heights and avoid high places."],
        "responses": ["It's only natural to feel this way. I'm here for you.", "It'll all be okay. This feeling is only momentary.", "I understand how you feel. Don't put yourself down because of it.",

        "Try focusing on what's within your control and seek support for your concerns," ,
        "Talk to someone you trust about your fears and consider professional help if needed,",
         "Practice relaxation techniques such as deep breathing or meditation to calm your heart rate,",
          "Challenge your fears by gradually exposing yourself to the situations that scare you," ,
          "Talk to a therapist about your past experiences and how to manage your fears," ,
          "Take small, calculated risks to build your confidence and overcome your fear of failure," ,
          "Make sure your home is safe and consider using a nightlight or other comfort items," ,
          "Gradually face situations where you fear losing control to build confidence,",
           "Practice socializing in small groups and work your way up to larger gatherings,",
            "Consider professional support for phobias and practice exposure therapy to overcome your fears."]
    },
    {"tag": "death",
        "patterns": ["My mom died", "My brother died", "My dad passed away", "My sister passed away", "Someone in my family died", "My friend passed away",

        "An elderly family member peacefully passes away in their sleep after a long and fulfilling life," ,
        "A car crash results in the tragic death of a young driver on their way home from work,",
         "A cancer patient succumbs to their illness despite undergoing extensive treatments and therapies," ,
         "A teenager takes their own life due to struggles with mental health issues and bullying at school,",
          "A victim of domestic violence is fatally injured by their abusive partner during a violent altercation," ,
          "A family loses their home and lives in a devastating earthquake that strikes their community," ,
          "A surgical error during a routine procedure leads to the unexpected death of a patient in the hospital,",
           "An individual dies from an overdose of opioids after struggling with addiction for years," ,
           "A soldier is killed in combat while serving in a war zone overseas, leaving behind a grieving family,",
            "A terminally ill patient opts for assisted suicide to end their suffering and maintain dignity in their final moments."],
        "responses": ["I'm sorry to hear that. If you want to talk about it. I'm here.", "I am really sorry to hear that. I am here to help you with grief, anxiety and anything else you may feel at this time.", "My condolences. I'm here if you need to talk.",

        "I'm deeply sorry to hear about your loss. Losing a loved one is never easy, and it's completely natural to feel a wide range of emotions during this time. If you need someone to talk to or support in any way, please don't hesitate to reach out."
        
        ,"That sounds incredibly difficult to go through. Feeling alone can be overwhelming, but please know that you're not truly alone. There are people who care about you and are here to offer support whenever you need it."
        
       , "Ending a relationship can be incredibly challenging, and it's normal to feel a mix of emotions right now. Take time to process your feelings and remember that it's okay to grieve the loss of the relationship. Surround yourself with supportive friends and family who can help you through this difficult time."
        
        ,"I'm sorry to hear that you didn't get the promotion you were hoping for. It's understandable to feel disappointed and frustrated, especially after putting in so much effort. Remember that setbacks like this are not a reflection of your worth or abilities."
        
        ,"It's tough when plans don't go as expected, especially when you were looking forward to spending time with someone. If you're feeling disappointed or lonely, consider reaching out to friends or family for support. Sometimes, just talking about how you're feeling can help."
        
        ,"I'm sorry to hear that you're facing financial difficulties. It's understandable to feel stressed and overwhelmed when struggling to make ends meet. There may be resources available to help you navigate this situation, such as financial assistance programs or nonprofit organizations that offer support."
        
        ,"I'm sorry to hear that you're experiencing increased pain. Chronic pain can be incredibly challenging to manage, both physically and emotionally. It's important to prioritize self-care and seek support from healthcare professionals who can help you find ways to cope with your pain."
        
       , "It sounds like things have been tense at home lately. Family arguments can be difficult to navigate, but it's important to remember that conflicts are a normal part of relationships. If you're feeling overwhelmed, consider reaching out to a therapist or counselor who can provide guidance and support."
        
        ,"I'm sorry to hear that your plans fell through. Disappointments like this can be frustrating, but it's important to remember that it's okay to feel disappointed. If you're feeling down, consider doing something enjoyable or relaxing to help lift your spirits."
        
       , "It's tough to see a friend going through a tough time. Offering support and being there to listen can make a big difference, even if you're not sure what to say. Let your friend know that you're there for them whenever they need you."]
    },
    {"tag": "understand",
        "patterns": ["You don't understand me.", "You're just some robot. How would you know?", "You can't possibly know what i'm going through", "You're useless", "You can't help me", "Nobody understands me.","You're not getting it",
        "I feel like I'm talking to a wall"],
        "responses": ["It sound like i'm not being very helpful right now.", "I'm sorry to hear that. I'm doing my best to help", "I'm trying my best to help you. So please talk to me","I understand it's frustrating when you feel misunderstood.",
        "I may not fully understand, but I'm here to listen and support you.","Sometimes it takes time to truly understand. Let's talk it out.","Feeling misunderstood is tough. Let's work together to bridge that gap.",
        "Your feelings are valid. Let's explore them further together.",
        "Communication can be challenging, but I'm here to listen and learn."]
    },
    {"tag": "done",
        "patterns": ["That's all.", "I don't have anything more to say", "Nothing else", "That's all i have to say", "no, that would be all","I'm finished",
        "End of discussion",
        "I'm done talking",
        "I think we covered everything",
        "That wraps it up",
        "No more questions",
        "I wish I could find someone who understands.",
        "You're not seeing the bigger picture here.",
        "I need more than just automated responses.",
        "Is there a real person I can talk to?",
        "Can you try to put yourself in my shoes?",
        "I need more than just words right now.",
        "I feel like I'm not being heard.",
        "It's hard to open up when I feel misunderstood.",
        "I want to feel like my feelings matter.",
        "I need validation for what I'm going through.",
        "Can we find common ground in this discussion?",
        "This conversation is leaving me more frustrated.",
        "I want to feel a connection in our conversation."],
        "responses": ["I heard you & noted it all. See you later.", "Oh okay we're done for today then. See you later", "I hope you have a great day. See you soon", "Okay we're done. Have a great day", "Okay I see. Enjoy the rest of your day then","Thank you for sharing. Take care and have a wonderful day.",
        "If you need anything else, feel free to reach out. Have a good one!",
        "It was nice chatting with you. Take care and goodbye.",
        "Understood. Feel free to return anytime if you have more to discuss.",
        "Your thoughts are important. Take care and goodbye.",
        "Wishing you a peaceful day ahead. Goodbye for now.",
        "Let's take a step back and try to bridge this communication gap together.",
        "I'm committed to improving our dialogue. How can we make this conversation more meaningful for you?",
        "Your experiences matter, and I want to acknowledge and understand them better.",
        "Empathy is key in our interaction. Let's work on building that connection.",
        "I value your input, and I'm here to adapt to your needs. How can I support you better?",
        "Let's aim for a deeper level of understanding. What specific aspect do you feel I'm missing?",
        "Communication challenges can be frustrating, but I'm dedicated to making progress.",
        "Let's focus on finding common ground. What are some shared aspects we can agree on?",
        "I'm here to engage in meaningful conversations. How can we make this conversation more impactful for you?",
        "I want to ensure that your voice is heard and understood. How can we achieve that?",
        "Validating your emotions and experiences is important to me. Let's explore that further.",
        "Our connection is valuable, and I want to strengthen it. How can I be more supportive?",
        "Let's approach this conversation with openness and a willingness to understand each other.",
        "Your insights are valuable, and I'm here to listen and learn from them.",
        "I'm committed to improving our interaction. Let's collaborate on making it better."]
    },
    {"tag": "suicide",
        "patterns": ["I want to kill myself", "I've thought about killing myself.", "I want to die", "I am going to kill myself", "I am going to commit suicide","Life feels unbearable right now",
        "I feel like there's no way out",
        "I don't see a reason to keep going",
        "I'm in so much pain, I just want it to end"],
        "responses": ["I'm very sorry to hear that but you have so much to look forward to. Please seek help by contacting: 9152987821.","It's important to talk to someone who can help you through this. You are not alone in this, and there are resources available to support you. Please reach out to a trusted friend, family member, or mental health professional.",
        "Your feelings are valid, and it's crucial to take them seriously. I urge you to contact a crisis hotline or a mental health professional right away. Your well-being is important.",
        "Please know that there are options and people who can help you through this difficult time. Reach out to a mental health professional or a crisis intervention hotline immediately.",
        "Suicidal thoughts are serious, and it's important to seek help immediately. Contact a crisis helpline or a mental health professional who can provide the support you need.",
        "You are not alone in your struggle, and there are trained professionals who can provide the help and support you deserve. Please reach out to someone who can assist you during this difficult time."]
    }, 
    {"tag": "hate-you",
        "patterns": ["I hate you", "I don't like you", "I don't trust you","You're annoying",
        "You're useless",
        "I regret talking to you",
        "You're not helpful",
        "I wish you were gone",
        "I don't want your help",
        "You're a waste of time",
        "You're a terrible bot"],
        "responses": ["I'm sorry if i offended you in anyway. I'm only here to help", "Forgive me if i did anything to offend you. I only want to help","I understand your frustration. Let's try to work together positively.",
        "I'm sorry to hear that. Is there something specific I can do to improve?",
        "Negative feelings are valid. Let's work together to find a better way forward.",
        "It's okay to feel that way. How can I make things better for you?",
        "Your feedback is important to me. Let's discuss how I can better assist you.",
        "I'm here to help, even if you're feeling upset right now.",
        "Let's focus on finding solutions. How can I assist you better?",
        "I'm committed to improving your experience. Let's address any concerns you have.",
        "I'm here to listen and understand. Your feedback helps me improve."]
    },
    {"tag": "default",
        "patterns": ["exams", "friends", "relationship", "boyfriend", "girlfriend", "family", "money", "financial problems","work",
        "stress",
        "anxiety",
        "depression",
        "loneliness",
        "health",
        "self-esteem",
        "motivation",
        "procrastination",
        "goals",
        "hobbies",
        "sleep issues",
        "weight",
        "diet",
        "exercise",
        "career",
        "future",
        "technology",
        "social media",
        "addiction",
        "time management",
        "communication skills"],
        "responses": ["Oh I see. Tell me more", "I see. What else?", "Tell me more about it.", "Oh okay. Why don't you tell me more about it?", "I'm listening. Tell me more.","Let's delve deeper into that. Can you elaborate?",
        "That's interesting. Can you share more details?",
        "I'm here to listen. Feel free to share more.",
        "I'm curious to know more. Please continue.",
        "Feel free to express yourself further. I'm here to understand.",
        "Your perspective matters. Share more about your thoughts.",
        "Let's explore that topic further. What are your thoughts?",
        "It's important to talk about this. What else is on your mind?",
        "I'm here to support you. Tell me more about your experiences.",
        "Your feelings are valid. Tell me more about how you're feeling.",
        "Let's break it down. What aspects are you most concerned about?",
        "I'm here to help with any questions or concerns you have.",
        "Your well-being matters. Let's discuss how you're feeling.",
        "We can work through this together. What else would you like to share?",
        "I appreciate you sharing this. Let's talk more about it."]
    },
    {"tag": "repeat",
        "patterns": ["You already told me that", "You mentioned that already", "Why are you repeating yourself?","We covered this topic already",
        "You're going in circles",
        "You're reiterating the same point",
        "This sounds familiar",
        "Haven't we discussed this?",
        "I recall you mentioning this earlier",
        "Are we revisiting this topic?",
        "You're recycling the same information",
        "This is a repetition",
        "We're back to square one",
        "I feel like we've talked about this",
        "I'm getting a dj vu",
        "This conversation feels redundant",
        "You're echoing yourself",
        "We're going over old ground"],
        "responses": ["Oh sorry I didn't realise that. I'll try not to repeat myself again.","I must have lost track. Thanks for letting me know.",
        "Oops, my mistake. Let's focus on something else.",
        "I appreciate your patience. Let's shift to a different topic.",
        "Noted, I'll ensure it doesn't happen again.",
        "Thanks for catching that. Let's explore another subject.",
        "I'll be more mindful of not repeating information.",
        "I apologize for the repetition. What else would you like to discuss?",
        "I see, I repeated myself there. Let's find a new topic to talk about.",
        "You're correct, I repeated the point. What's on your mind now?",
        "Got it, I'll avoid repeating myself from now on.",
        "My apologies. Let's move on to something fresh.",
        "I'll make sure to vary my responses. What's next on your agenda?",
        "Noted, let's move forward with a different topic.",
        "Thanks for pointing that out. What else can I help you with?",
        "I understand, let's transition to another topic.",
        "You're right, that was repetitive. What's your take on this?"]
    },
    {"tag": "wrong",
        "patterns": ["What are you saying?", "That doesn't make sense", "Wrong response", "Wrong answer","I don't understand",
        "I'm confused"],
        "responses": ["I'm very sorry. Let's try that again","Let me clarify that for you. What part do you need more information on?",
        "It seems there might have been a misunderstanding. Can you provide more context?",
        "I apologize if I didn't provide the information you were expecting. How can I assist you better?",
        "I understand the confusion. Let's break it down step by step.",
        "Your feedback is important. Please let me know how I can assist you more effectively."]
    },
    {
        "tag": "self-stupid",
        "patterns": [
            "I feel stupid",
            "I think I'm dumb",
            "I'm not very smart",
            "I'm feeling incompetent",
            "I doubt my abilities",
        "I'm struggling to understand",
        "I make too many mistakes",
        "I feel like I'm not good enough",
        "I compare myself to others",
        "I'm afraid of looking foolish",
        "I lack confidence in myself",
        "I feel like an imposter",
        "I'm hesitant to speak up",
        "I second-guess myself constantly",
        "I feel overwhelmed by tasks",
        "I fear failure",
        "I avoid challenges because I feel inadequate",
        "I'm worried about my performance",
        "I'm not reaching my potential",
        "I feel like I'm letting others down"
        ],
        "responses": [
            "It's important to remember that everyone has moments of self-doubt. What specifically is making you feel this way?",
            "Feeling this way can be tough, but it doesn't define your intelligence. Let's talk about what's on your mind.",
            "Being hard on yourself can sometimes cloud your judgment. Let's focus on solutions and positive steps forward.",
            "You're capable and worthy, even when you feel this way. What can we do to improve your confidence?",
            "Let's explore where these feelings are coming from. Is there a specific situation that triggered these thoughts?",
        "It's normal to struggle at times. Let's break down the challenges you're facing and find ways to overcome them.",
        "Remember that mistakes are opportunities for growth. Let's discuss what you've learned from recent experiences.",
        "Your worth isn't tied to your perceived intelligence. Let's work on building a positive self-image together.",
        "Comparing yourself to others can be misleading. Let's focus on your unique strengths and progress.",
        "Imposter feelings are common. Let's explore your accomplishments and validate your skills and contributions.",
        "Speaking up takes courage. Let's work on strategies to boost your confidence in expressing yourself.",
        "Self-doubt can be paralyzing. Let's break tasks into manageable steps and celebrate your achievements along the way.",
        "Failure is part of growth. Let's reframe mistakes as learning opportunities and move forward with resilience.",
        "Avoiding challenges can limit your potential. Let's set realistic goals and support your progress step by step.",
        "Performance concerns are valid. Let's identify areas for improvement and develop a plan to enhance your skills.",
        "Your potential is vast. Let's uncover barriers holding you back and create a path toward realizing your goals.",
        "Others' expectations shouldn't dictate your worth. Let's focus on self-acceptance and self-validation.",
        "Feeling inadequate is temporary. Let's build a toolbox of strategies to boost your confidence in various situations.",
        "Your efforts matter. Let's acknowledge your dedication and explore ways to enhance your impact positively.",
        "Remember, progress is gradual. Let's celebrate small victories and maintain a growth mindset.",
        "Your well-being matters. Let's address any concerns or pressures contributing to these feelings."
        ]
    },
    {"tag": "something-else",
        "patterns": ["I want to talk about something else", "Let's talk about something else.", "Can we not talk about this?", "I don't want to talk about this.","Can we discuss something different?",
        "I have another topic in mind",
        "Let's talk about something new",
        "I'm looking for a different conversation",
        "This isn't what I had in mind",
        "Can we move on to a different topic?",
        "I'd like to talk about something else",
        "I'm not feeling this topic",
        "Let's talk about a different subject",
        "This topic isn't grabbing my interest",
        "Can we change the subject?",
        "Let's discuss something else",
        "I'm looking for a different discussion",
        "Can we talk about something new?",
        "This conversation isn't what I expected",
        "I'm interested in a different topic"],
        "responses": ["Okay sure. What do you want to talk about?", "Alright no problem. Is there something you want to talk about?", "Is there something else that you want to talk about?","No worries. What topic would you like to discuss?",
        "Got it. What's the new topic you'd like to talk about?",
        "Sure thing. What's the other topic you have in mind?",
        "Absolutely, let's change the topic. What's your preference?",
        "Sure, let's shift gears. What's the new topic?",
        "Understood. What would you like to discuss instead?",
        "Sure, we can talk about something different. What's on your mind?",
        "Absolutely, we can talk about a different subject. What's your choice?",
        "Of course, we can move on. What would you like to discuss?",
        "Certainly, let's change the subject. What interests you?",
        "No problem at all. What topic are you interested in?",
        "Sure thing. What's the new topic of discussion?",
        "Of course, we can discuss something new. What's on your mind?",
        "Absolutely, let's talk about something else. What's your idea?",
        "Sure, let's dive into a different topic. What's your preference?"]
    },
    {"tag": "friends",
        "patterns": ["I don't have any friends","I feel lonely",
        "No one understands me",
        "I struggle to connect with others",
        "I feel isolated",
        "I'm socially awkward"],
        "responses": ["I'm sorry to hear that. Just know that I'm here for you. Talking about it might help. Why do you think you don't have any friends?","Feeling lonely can be tough. Let's explore ways to connect with others or find activities that bring you joy.",
        "It's common to feel misunderstood at times. Opening up and sharing your thoughts and feelings can help bridge that gap.",
        "Connecting with others can be challenging, but it's not impossible. Let's brainstorm ways to improve your social interactions.",
        "Isolation can be difficult. Are there specific barriers preventing you from building friendships that we can address together?",
        "Many people experience social awkwardness. Let's work on building confidence and finding common ground with others."]
    },  
    
    {"tag": "ask",
        "patterns": ["Can I ask you something?","May I ask a question?",
        "I have a question for you",
        "Mind if I ask something?",
        "Do you mind answering a question?",
        "Can you help me with something?",
        "I need some information. Can you help?",
        "Is it okay if I ask you a question?",
        "Could you answer a question for me?",
        "I'm curious about something. Can you help?",
        "I need clarification on something. Can you explain?"],
        "responses": ["Sure. I'll try my best to answer you", "Of course. Feel free to ask me anything. I'll do my best to answer you","Absolutely, go ahead and ask your question.",
        "I'm here to help. Ask away!",
        "I'm ready to answer your question. What would you like to know?",
        "I'm available to assist. What's your question?",
        "Ask me anything. I'm here to provide information.",
        "No problem. Ask your question whenever you're ready.",
        "Feel free to ask your question. I'm here to help you.",
        "I'm all ears. What's on your mind?",
        "Sure thing. Fire away with your question!"]
    },
    {"tag": "problem",
        "patterns": ["Probably because my exams are approaching. I feel stressed out because I don't think I've prepared well enough.", "probably because of my exams","I feel overwhelmed by exam pressure",
        "I'm worried about failing my exams",
        "I can't focus on studying",
        "I keep procrastinating instead of studying",
        "I feel anxious about the upcoming exams",
        "I'm struggling to remember what I've studied",
        "I'm not confident in my exam preparation",
        "I'm feeling pressured to perform well in exams"],
        "responses": ["I see. Have you taken any approaches to not feel this way?","It's common to feel stressed before exams. Have you tried creating a study schedule?",
        "Let's break down your study material into manageable chunks. How can I help?",
        "Setting realistic goals for your exams can reduce stress. Have you set any goals?",
        "Practice relaxation techniques like deep breathing or meditation to manage exam stress.",
        "Taking breaks during study sessions can improve focus and retention. Have you tried the Pomodoro technique?",
        "Visualization techniques can help boost confidence for exams. Have you tried visualizing success?",
        "Seeking support from peers or teachers can clarify doubts and reduce anxiety about exams.",
        "Organizing study notes and materials can improve study efficiency. How do you usually organize your study materials?",
        "Remember, exams are not just about grades but also about learning. Focus on understanding concepts rather than memorization."]
    },
    
    {"tag": "no-approach",
        "patterns": ["I guess not. All I can think about are my exams.", "not really", "i guess not","I don't know where to start",
        "I'm feeling stuck",
        "I'm not sure what to do",
        "I'm not feeling motivated",
        "I feel overwhelmed by everything",
        "I don't have a plan",
        "I'm not ready to tackle this yet"],
        "responses": ["That's no problem. I can see why you'd be stressed out about that. I can suggest you some tips to alleviate this issue. Would you like to learn more about that?","It's okay to feel unsure or stuck. We can work together to brainstorm ideas and create a plan.",
        "Feeling overwhelmed is normal, especially with exams looming. Let's break it down into smaller, manageable steps.",
        "Not having a plan can be stressful, but we can create one together based on your goals and priorities.",
        "Taking small steps each day can make a big difference. Let's explore strategies that work for you.",
        "Sometimes motivation comes after taking the first step. Let's find a starting point together.",
        "Feeling stuck is common, but we can explore different approaches and find what resonates with you.",
        "It's okay to take your time and approach things at your own pace. We can develop a strategy that suits you.",
        "Feeling unsure is okay. Let's discuss your concerns and explore potential solutions.",
        "Remember, progress is progress no matter how small. Let's focus on what we can do today."]
    },
    {"tag": "learn-more",
            "patterns": ["ok sure. i would like to learn more about it.", "yes, i would like to learn more about it.", "i would like to learn more about it."],
        "responses": ["So first I would suggest you to give yourself a break. Thinking more and more about the problem definitely does not help in solving it. You'll just end up overwhelming yourself."]
    },
    {"tag": "user-agree",
        "patterns": ["yeah you're right. i deserve a break.", "Yeah you're absolutely right about that","I agree with you",
        "You make a good point",
        "That's a good idea",
        "I think you're onto something",
        "I need to take care of myself better",
        "I should prioritize my well-being"],
        "responses": ["Next, I would suggest you to practice meditation. Meditation can produce a deep state of relaxation and a tranquil mind.","Consider incorporating mindfulness practices into your daily routine. Mindfulness can help reduce stress and improve mental clarity.",
        "It might be helpful to create a self-care routine. Dedicate time each day for activities that bring you joy and relaxation.",
        "Engage in physical activities like yoga or walking. Exercise not only benefits your body but also enhances your mood and mental well-being.",
        "Journaling can be a great way to express your thoughts and emotions. It can also provide clarity and insights into your feelings.",
        "Connect with supportive friends or family members. Sharing your feelings and experiences with others can provide comfort and perspective.",
        "Explore hobbies or activities that bring you fulfillment and happiness. Taking time for yourself is important for overall well-being.",
        "Consider seeking professional support from a therapist or counselor. Talking to a mental health professional can provide valuable guidance and support."]
    },
    {"tag": "meditation",
        "patterns": ["hmmm that sounds like it could be useful to me.", "That sounds useful.","I want to start meditating.",
        "How can I meditate?",
        "Can you guide me through meditation?",
        "I need help calming my mind.",
        "I'm feeling stressed and need to relax."],
        "responses": ["Focus all your attention on your breathing. Concentrate on feeling and listening as you inhale and exhale through your nostrils. Breathe deeply and slowly. When your attention wanders, gently return your focus to your breathing.","Find a quiet and comfortable place to sit or lie down. Close your eyes and bring your attention to your breath. Inhale deeply through your nose, hold for a moment, and exhale slowly through your mouth. Repeat this breathing pattern and let go of any tension in your body.",
        "Start by finding a comfortable position and taking deep breaths. Focus on the present moment and let go of any distracting thoughts. Visualize a peaceful place or use calming music to enhance your meditation experience.",
        "Meditation involves being present in the moment. Focus on your breath, sensations in your body, or repeat a calming mantra. Allow yourself to let go of worries and find inner peace.",
        "Practice mindfulness by observing your thoughts without judgment. Let thoughts pass by like clouds in the sky, and gently bring your attention back to your breath whenever your mind wanders.",
        "Use guided meditation apps or videos to help you get started. Follow along with instructions for deep breathing, relaxation techniques, and positive affirmations.",
        "Consistent meditation practice can reduce stress, improve focus, and promote overall well-being. Start with short sessions and gradually increase the duration as you become more comfortable."]
    },
    {"tag": "user-meditation",
        "patterns": ["i did what you said and i feel alot better. thank you very much.", "I feel better now","Meditation really helped me calm down",
        "I tried mindfulness and it made a difference",
        "Thank you for the meditation tips",
        "I feel more focused after practicing meditation",
        "Mindfulness exercises are really effective",
        "I feel more at peace now",
        "Deep breathing helped me relax",
        "I feel less stressed after meditation"],
        "responses": ["Your welcome. Remember: Always focus on what's within your control. When you find yourself worrying, take a minute to examine the things you have control over. You can't prevent a storm from coming but you can prepare for it. You can't control how someone else behaves, but you can control how you react. Recognize that sometimes, all you can control is your effort and your attitude. When you put your energy into the things you can control, you'll be much more effective.","That's great to hear! Incorporating mindfulness into your routine can have long-lasting effects.",
        "Mindfulness and meditation can bring profound changes. Keep exploring different techniques to find what works best for you.",
        "I'm glad the meditation tips were helpful. Keep exploring mindfulness practices for continued well-being.",
        "Practicing mindfulness regularly can improve focus, reduce stress, and enhance overall well-being.",
        "The power of meditation lies in its ability to center and ground us. Keep nurturing your meditation practice.",
        "Feeling more at peace is a wonderful outcome of meditation. Keep prioritizing self-care and mindfulness.",
        "Remember to be gentle with yourself during meditation. It's okay to have wandering thoughts; gently guide your focus back to your breath or mantra.",
        "Deep breathing exercises are a great tool for managing stress and promoting relaxation. Keep incorporating them into your day.",
        "Less stress and more calmness are signs of progress in meditation. Keep up the good work!"]
    },
    {"tag": "pandora-useful",
        "patterns": ["thank you very much again. i'll continue practicing meditation and focus on what i can control.",
        "Your suggestions were helpful. I'll continue with them.",
        "I'll follow your guidance. Thanks for the support.",
        "Your insights were valuable. I'll focus on improvement.",
        "I'll take your words to heart. Thank you.",
        "I'm grateful for your assistance. I'll apply it diligently.",
        "Your tips are beneficial. I'll practice them regularly.",
        "I'll heed your advice. Thank you for the direction.",
        "Your recommendations make sense. I'll stick to them.",
        "I'll remember your suggestions. Thank you.",
        "I'm thankful for your guidance. I'll work on it.",
        "Thanks for pointing me in the right direction. I'll keep at it.",
        "I'll keep your words in mind. Thanks for the support.",
        "Your help means a lot. I'll continue on this path.",
        "I appreciate your input. I'll focus on progress.",
        "Thanks for the encouragement. I'll stay positive.",
        "Your advice is valuable. I'll follow through.",
        "I'll remember your tips. Thank you for the assistance.",
        "I'll stick to your recommendations. Thanks again."],
        "responses": ["I'm glad you found this useful. Is there something else I can help you with?",
        "That's great to hear. Let me know if there's anything else I can assist you with.",
        "I'm happy I could assist you. Feel free to reach out anytime.",
        "Awesome! Keep practicing, and you'll see progress.",
        "You got it! Keep focusing on what's within your control.",
        "No problem at all. Happy to help!",
        "It's my pleasure to assist you. Let me know if there's more I can do.",
        "You're on the right track. Keep moving forward!",
        "You're welcome! Keep up the positive efforts.",
        "I'm glad I could provide helpful insights. Keep it up!",
        "Anytime! Remember, progress comes with consistent effort.",
        "That's great news! Keep practicing and stay focused.",
        "I'm here to support you. Keep up the good work!",
        "You're doing great! Keep following the path to improvement.",
        "You're welcome. Keep practicing mindfulness!",
        "Happy to hear that you found the suggestions useful!",
        "No worries! I'm here whenever you need assistance.",
        "Keep practicing and staying positive. You've got this!",
        "You're making progress already. Keep it up!"]
    },
    {"tag": "user-advice",
        "patterns": ["I want some advice.", "I need some advice.", "I need advice on something","Can you give me some advice?",
        "Do you have any advice for me?",
        "I'm looking for guidance.",
        "I need help making a decision."],
        "responses": ["Sure. What can I do to help?", "Okay what do you need advice on?","I'm here to offer guidance. Feel free to share what's on your mind.",
        "I'll do my best to provide helpful advice. Please tell me more about your situation.",
        "Of course, I'm here to offer support and advice. What's on your mind?",
        "Decisions can be tough. I'm here to help you navigate through them. What's your dilemma?",
        "Seeking advice is a positive step. Let's discuss what you need help with."]
    },
    {"tag": "fact-5",
        "patterns": ["How do i know if i have Depression?", "Am i depressed?", "Am i suffering from depression?", "Am i mentally ill?","What are the signs of depression?",
        "How can I tell if I'm experiencing depression?",
        "What are the symptoms of depression?",
        "I feel down all the time. Could it be depression?",
        "Is constant sadness a sign of depression?",
        "Are mood swings related to depression?",
        "Can anxiety and depression coexist?",
        "Do physical symptoms indicate depression?",
        "Can depression be genetic?",
        "Can traumatic experiences lead to depression?",
        "Is lack of motivation a symptom of depression?",
        "Can depression affect sleep patterns?",
        "Can depression cause physical pain?",
        "Is isolation a common behavior in depression?",
        "How does depression affect daily life?",
        "Can depression be treated effectively?",
        "Is seeking therapy beneficial for depression?"],
        "responses": ["For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks. Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day.","Depression can manifest differently in individuals but common symptoms include persistent sadness, loss of interest in activities, changes in appetite or weight, sleep disturbances, fatigue, feelings of worthlessness or guilt, difficulty concentrating, and thoughts of death or suicide.",
        "It's essential to consult a mental health professional for a proper evaluation if you suspect depression. They can assess your symptoms, history, and overall well-being to provide an accurate diagnosis and recommend appropriate treatment.",
        "Depression is a complex condition influenced by biological, psychological, and environmental factors. It's not just feeling sad occasionally but a persistent and pervasive mood disturbance that impacts daily functioning.",
        "While self-assessment tools can offer insights, they are not substitutes for professional diagnosis and treatment. If you're concerned about depression, reach out to a healthcare provider or mental health professional for guidance and support.",
        "Depression can coexist with other mental health conditions such as anxiety, and they may share similar symptoms. Proper assessment by a healthcare professional can differentiate between various mental health disorders.",
        "Genetic factors can play a role in depression, but it's not solely determined by genes. Environmental influences, life experiences, and coping strategies also contribute to the development and course of depression.",
        "Experiencing trauma or significant life stressors can increase the risk of developing depression. It's essential to address both the underlying causes and the symptoms through therapy, support networks, and healthy coping strategies.",
        "Motivation and energy levels can decrease significantly in depression, affecting daily activities and responsibilities. Seeking professional help can provide strategies to manage these symptoms and improve overall well-being.",
        "Depression can disrupt sleep patterns, leading to insomnia or excessive sleepiness. Addressing sleep disturbances is an important aspect of depression treatment to restore restful sleep and enhance mood.",
        "Depression can manifest as physical symptoms such as headaches, digestive issues, or chronic pain. These symptoms often accompany emotional distress and are addressed in holistic treatment approaches.",
        "Isolation and withdrawal from social activities are common in depression due to feelings of sadness, low self-esteem, or lack of interest. Building social connections and engaging in supportive relationships can aid in recovery.",
        "Depression can impact various aspects of daily life, including work, relationships, self-care, and overall quality of life. Seeking treatment early can prevent worsening symptoms and improve functioning.",
        "Treatment options for depression include therapy (such as cognitive-behavioral therapy), medication (like antidepressants), lifestyle changes (such as exercise and stress management), and support networks. A combination of approaches is often effective.",
        "Therapy can be highly beneficial for managing depression by providing coping skills, emotional support, and strategies for challenging negative thoughts and behaviors. It offers a safe space to explore feelings and work towards recovery.",
        "Exploring different therapy modalities such as talk therapy, behavioral therapy, or mindfulness-based approaches can help individuals find effective strategies for managing depression symptoms.",
        "Medication can be a valuable tool in treating depression, especially for moderate to severe cases or when therapy alone is not sufficient. It's important to work closely with a healthcare provider to find the right medication and dosage.",
        "Self-care practices such as regular exercise, balanced nutrition, sufficient sleep, stress management techniques, and engaging in enjoyable activities can complement professional treatment for depression.",
        "Support groups and peer networks can provide valuable understanding, empathy, and encouragement for individuals dealing with depression. Connecting with others who share similar experiences can reduce feelings of isolation.",
        "Consistent follow-up with mental health professionals, adherence to treatment plans, open communication about symptoms and concerns, and proactive management of stressors are key components of long-term depression management.",
        "Recovery from depression is possible with proper diagnosis, treatment, and ongoing support. It's important to prioritize self-care, seek professional help when needed, and stay engaged in a supportive network."]
    },
    {"tag": "fact-26",
        "patterns": ["Are there cures for mental health problems?", "is there any cure for mental health problems?",
        "Are there definitive treatments for all mental health conditions?",
        "Can therapy alone cure mental health disorders?",
        "Do medications guarantee a complete recovery from mental health challenges?",
        "Are there holistic approaches to mental wellness?",
        "Can lifestyle changes improve mental health conditions?",
        "Is long-term management necessary for mental health disorders?",
        "Are there natural remedies for mental health concerns?",
        "Do mental health issues require ongoing support?",
        "Is mental health recovery a gradual process?",
        "Can social support networks aid in mental health recovery?",
        "Are there effective self-care strategies for mental well-being?",
        "Do coping mechanisms play a role in mental health improvement?",
        "Is early intervention crucial for mental health conditions?",
        "Can mental health challenges affect physical health?",
        "Are there specialized therapies for different mental health disorders?",
        "Can mindfulness practices benefit mental health?",
        "Are there cultural differences in mental health treatments?"],
        "responses": ["It is often more realistic and helpful to find out what helps with the issues you face. Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help.","Therapy is an essential tool, but it's often part of a comprehensive treatment plan that may include other strategies.",
        "Medications can be effective, but they are typically part of a broader treatment plan that includes therapy and lifestyle changes.",
        "Holistic approaches like mindfulness, exercise, nutrition, and social connections can complement traditional treatments.",
        "Lifestyle changes such as regular exercise, balanced nutrition, and quality sleep can significantly impact mental well-being.",
        "Long-term management and support are often necessary for managing chronic mental health conditions effectively.",
        "Natural remedies like meditation, herbal supplements, and relaxation techniques can be beneficial for some individuals.",
        "Ongoing support systems such as therapy, support groups, and healthy relationships are crucial for mental health.",
        "Recovery from mental health challenges is often a gradual process that requires patience and persistence.",
        "Social support can be a powerful factor in mental health recovery, providing understanding, empathy, and encouragement.",
        "Self-care practices like mindfulness, journaling, hobbies, and setting boundaries can contribute to mental well-being.",
        "Effective coping mechanisms such as problem-solving skills, stress management, and emotional regulation are key for mental health.",
        "Early intervention and treatment can prevent the worsening of mental health conditions and improve long-term outcomes.",
        "Mental health issues can impact physical health, emphasizing the importance of integrated healthcare approaches.",
        "Tailored therapies such as cognitive-behavioral therapy (CBT), dialectical behavior therapy (DBT), and exposure therapy address specific mental health challenges.",
        "Mindfulness practices like meditation and yoga have shown positive effects on mental health and well-being.",
        "Cultural factors influence how mental health is perceived and treated, highlighting the importance of culturally competent care.",
        "Combining traditional treatments with complementary approaches can create comprehensive mental health care plans."
    ]
    },
    {"tag": "fact-30",
        "patterns": ["How can I maintain social connections? What if I feel lonely?","How do I reach out to friends or family if I feel lonely?",
        "Are there online communities I can join to combat loneliness?",
        "What are some creative ways to stay connected with friends and family?",
        "How can I manage feelings of isolation and loneliness?",
        "I'm struggling with loneliness. What are some practical steps I can take?",
        "Can you suggest activities for fostering social connections while staying at home?",
        "What role does communication play in maintaining social connections?",
        "How do I express my feelings of loneliness to others?",
        "Are there support groups available for people feeling isolated?",
        "Can you provide guidance on making new friends in a digital environment?",
        "What are the benefits of maintaining social connections?",
        "How do I set boundaries in my social interactions while staying connected?",
        "What should I do if I feel disconnected from my social networks?",
        "How do I balance virtual interactions with face-to-face connections?",
        "What are some warning signs of social isolation and loneliness?",
        "How can I help others who may be feeling lonely or isolated?"],
        "responses": ["A lot of people are alone right now, but we don't have to be lonely. We're all in this together. Think about the different ways to connect that are most meaningful for you. For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call.",
        "Building meaningful social connections requires genuine conversations, active listening, and mutual support. Share your experiences and emotions openly with trusted individuals.",
        "Reach out to friends or family members via phone calls, text messages, or video chats. Express your feelings honestly and ask for their support and understanding.",
        "Online communities, social media groups, and forums related to your interests or hobbies can offer opportunities to connect with like-minded individuals.",
        "Creativity is key to staying connected. Try hosting virtual parties, collaborative online projects, or sharing playlists and book recommendations with friends.",
        "Managing loneliness involves acknowledging your feelings, practicing self-compassion, seeking professional support if needed, and exploring new ways to connect.",
        "Practical steps include joining online workshops or classes, volunteering for virtual initiatives, participating in online book clubs, or starting a blog or vlog.",
        "Activities like virtual cooking sessions, online gaming, collaborative art projects, or virtual fitness challenges can foster social connections in a fun way.",
        "Effective communication involves active listening, empathy, clear expression of feelings and needs, and maintaining healthy boundaries in relationships.",
        "Express your feelings honestly and calmly. Use 'I' statements to describe how you feel and what you need from your social connections.",
        "Explore online support groups, mental health hotlines, virtual therapy options, or local community resources for assistance and guidance.",
        "Initiate conversations in online communities, attend virtual networking events or webinars, and explore platforms designed for making new connections.",
        "Maintaining social connections boosts emotional well-being, reduces stress, promotes a sense of belonging, and provides valuable support during challenging times.",
        "Set boundaries by communicating your availability and preferences clearly, scheduling dedicated social times, and taking breaks when needed to recharge.",
        "Stay proactive in reaching out, engaging in meaningful conversations, sharing experiences, and seeking support from trusted individuals or professionals.",
        "Balance virtual interactions with occasional in-person meetups, outdoor activities, or small group gatherings following safety guidelines.",
        "Warning signs may include persistent feelings of sadness or isolation, withdrawal from usual activities, changes in sleep or eating patterns, and lack of interest in social interactions.",
        "Offer support by actively listening, checking in regularly, suggesting virtual activities, and connecting them with relevant resources or support groups."]
    }

    ]
}